// ARM json: Step 7 - Sentinel Pipeline and Threat Response
// Based on step07_sentinel_pipeline.md

{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "metadata": {
    "_generator": {
      "name": "bicep",
      "version": "0.37.4.10188",
      "templateHash": "6069663371879045549"
    }
  },
  "parameters": {
    "location": {
      "type": "string",
      "defaultValue": "[resourceGroup().location]"
    },
    "vmName": {
      "type": "string",
      "defaultValue": "vm-jhost-neu01"
    },
    "logAnalyticsWorkspaceName": {
      "type": "string",
      "defaultValue": "log-sentinel-neu01"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces",
      "apiVersion": "2022-10-01",
      "name": "[parameters('logAnalyticsWorkspaceName')]",
      "location": "[parameters('location')]",
      "properties": {
        "sku": {
          "name": "PerGB2018"
        },
        "retentionInDays": 30,
        "features": {
          "enableLogAccessUsingOnlyResourcePermissions": true
        }
      }
    },
    {
      "type": "Microsoft.OperationsManagement/solutions",
      "apiVersion": "2015-11-01-preview",
      "name": "[format('SecurityInsights({0})', parameters('logAnalyticsWorkspaceName'))]",
      "location": "[parameters('location')]",
      "properties": {
        "workspaceResourceId": "[resourceId('Microsoft.OperationalInsights/workspaces', parameters('logAnalyticsWorkspaceName'))]"
      },
      "plan": {
        "name": "[format('SecurityInsights({0})', parameters('logAnalyticsWorkspaceName'))]",
        "publisher": "Microsoft",
        "product": "OMSGallery/SecurityInsights",
        "promotionCode": ""
      },
      "dependsOn": [
        "[resourceId('Microsoft.OperationalInsights/workspaces', parameters('logAnalyticsWorkspaceName'))]"
      ]
    },
    {
      "type": "Microsoft.Insights/diagnosticSettings",
      "apiVersion": "2021-05-01-preview",
      "scope": "[format('Microsoft.Compute/virtualMachines/{0}', parameters('vmName'))]",
      "name": "vm-to-sentinel",
      "properties": {
        "workspaceId": "[resourceId('Microsoft.OperationalInsights/workspaces', parameters('logAnalyticsWorkspaceName'))]",
        "metrics": [
          {
            "category": "AllMetrics",
            "enabled": true,
            "retentionPolicy": {
              "enabled": true,
              "days": 30
            }
          }
        ]
      },
      "dependsOn": [
        "[resourceId('Microsoft.OperationalInsights/workspaces', parameters('logAnalyticsWorkspaceName'))]"
      ]
    },
    {
      "type": "Microsoft.Insights/actionGroups",
      "apiVersion": "2023-01-01",
      "name": "security-alerts-ag",
      "location": "global",
      "properties": {
        "groupShortName": "SecAlerts",
        "enabled": true,
        "emailReceivers": [
          {
            "name": "Personal_Email",
            "emailAddress": "pervazgolrang@protonmail.com",
            "useCommonAlertSchema": true
          }
        ]
      }
    },
    {
      "type": "Microsoft.Insights/scheduledQueryRules",
      "apiVersion": "2022-06-15",
      "name": "multiple-failed-logins",
      "location": "[parameters('location')]",
      "properties": {
        "displayName": "Multiple Failed Login Attempts",
        "description": "Detects multiple failed login attempts",
        "severity": 2,
        "enabled": true,
        "scopes": [
          "[resourceId('Microsoft.OperationalInsights/workspaces', parameters('logAnalyticsWorkspaceName'))]"
        ],
        "evaluationFrequency": "PT5M",
        "windowSize": "PT1H",
        "criteria": {
          "allOf": [
            {
              "query": "SigninLogs | where TimeGenerated > ago(1h) | where ResultType != \"0\" | summarize FailedAttempts = count() by IPAddress | where FailedAttempts >= 5",
              "timeAggregation": "Count",
              "operator": "GreaterThan",
              "threshold": 0,
              "failingPeriods": {
                "numberOfEvaluationPeriods": 1,
                "minFailingPeriodsToAlert": 1
              }
            }
          ]
        },
        "actions": {
          "actionGroups": [
            "[resourceId('Microsoft.Insights/actionGroups', 'security-alerts-ag')]"
          ]
        }
      },
      "dependsOn": [
        "[resourceId('Microsoft.Insights/actionGroups', 'security-alerts-ag')]",
        "[resourceId('Microsoft.OperationalInsights/workspaces', parameters('logAnalyticsWorkspaceName'))]"
      ]
    }
  ],
  "outputs": {
    "logAnalyticsWorkspaceId": {
      "type": "string",
      "value": "[resourceId('Microsoft.OperationalInsights/workspaces', parameters('logAnalyticsWorkspaceName'))]"
    },
    "logAnalyticsWorkspaceName": {
      "type": "string",
      "value": "[parameters('logAnalyticsWorkspaceName')]"
    },
    "actionGroupId": {
      "type": "string",
      "value": "[resourceId('Microsoft.Insights/actionGroups', 'security-alerts-ag')]"
    }
  }
}